Table of Contents
 Interface IImporter
Namespace
IdeaStatiCa.BimApiLink.Importers
Assembly
IdeaStatiCa.BimApiLink.dll
public interface IImporter
Methods
 Create(IIdentifier)
IIdeaObject Create(IIdentifier identifier)
Parameters
identifier IIdentifier
Returns
IIdeaObject
 Create<T>(Identifier<T>)
T Create<T>(Identifier<T> identifier) where T : IIdeaObject
Parameters
identifier Identifier<T>
Returns
T
Type Parameters
T
 Edit this page